#SQL Basics

In [ ]:
import sqlite3

#Q.1. Create a Database and Table for Employees.
#Task: Create a new database company_db named and Create a table Employees named with the following
columns:
#->

import sqlite3
# Create in-memory database
conn = sqlite3.connect(":memory:")
# Create cursor
cursor = conn.cursor()
# Create Employees table
cursor.execute("""
CREATE TABLE employees (
    employee_id INTEGER PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    department VARCHAR(50),
    salary INTEGER,
    hire_date DATE
)
""")
print("In-memory SQLite database connection established and 'employees' table created.")

SyntaxError: invalid syntax (ipython-input-2402529180.py, line 5)

In [ ]:
#Q.2. Insert Data into Employees Table.
#Task: Insert the following sample records into the Employees table.
#->

# Clear existing data to allow re-running the cell without UNIQUE constraint errors
cursor.execute("DELETE FROM employees;")
conn.commit()

# Insert data into employees table
cursor.execute("""
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date)
VALUES
(101, 'Amit', 'Sharma', 'HR', 50000, '2020-01-15'),
(102, 'Riya', 'Kapoor', 'Sales', 75000, '2019-03-22'),
(103, 'Raj', 'Mehta', 'IT', 90000, '2018-07-11'),
(104, 'Neha', 'Verma', 'IT', 85000, '2021-09-01'),
(105, 'Arjun', 'Singh', 'Finance', 60000, '2022-02-10')
""")

conn.commit()

print("Data inserted successfully into employees table.")

#Verifying
cursor.execute("SELECT * FROM employees;")
rows = cursor.fetchall()

for row in rows:
    print(row)

Data inserted successfully into employees table.
(101, 'Amit', 'Sharma', 'HR', 50000, '2020-01-15')
(102, 'Riya', 'Kapoor', 'Sales', 75000, '2019-03-22')
(103, 'Raj', 'Mehta', 'IT', 90000, '2018-07-11')
(104, 'Neha', 'Verma', 'IT', 85000, '2021-09-01')
(105, 'Arjun', 'Singh', 'Finance', 60000, '2022-02-10')

In [ ]:
#Q3. Display All Employee Records Sorted by Salary (Lowest to Highest).
#Hint: Use the ORDER BY clause on the salary column.
#->
cursor.execute("""
SELECT *
FROM employees
ORDER BY salary ASC;
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

(101, 'Amit', 'Sharma', 'HR', 50000, '2020-01-15')
(105, 'Arjun', 'Singh', 'Finance', 60000, '2022-02-10')
(102, 'Riya', 'Kapoor', 'Sales', 75000, '2019-03-22')
(104, 'Neha', 'Verma', 'IT', 85000, '2021-09-01')
(103, 'Raj', 'Mehta', 'IT', 90000, '2018-07-11')

In [ ]:
#Q4. Show Employees Sorted by Department (A–Z) and Salary (High → Low).
#->
cursor.execute("""
SELECT *
FROM employees
ORDER BY department ASC, salary DESC;
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

(105, 'Arjun', 'Singh', 'Finance', 60000, '2022-02-10')
(101, 'Amit', 'Sharma', 'HR', 50000, '2020-01-15')
(103, 'Raj', 'Mehta', 'IT', 90000, '2018-07-11')
(104, 'Neha', 'Verma', 'IT', 85000, '2021-09-01')
(102, 'Riya', 'Kapoor', 'Sales', 75000, '2019-03-22')

In [ ]:
#Q5. List All Employees in the IT Department, Ordered by Hire Date (Newest First).
#->
cursor.execute("""
SELECT *
FROM employees
WHERE department = 'IT'
ORDER BY hire_date DESC;
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

(104, 'Neha', 'Verma', 'IT', 85000, '2021-09-01')
(103, 'Raj', 'Mehta', 'IT', 90000, '2018-07-11')

In [4]:

#Q6. Create and Populate a Sales Table.
#->
#Create Table
# Add DROP TABLE IF EXISTS to handle re-running the cell
cursor.execute("DROP TABLE IF EXISTS sales;")
cursor.execute("""
CREATE TABLE sales (
    sale_id INTEGER PRIMARY KEY,
    customer_name VARCHAR(50),
    amount INTEGER,
    sale_date DATE
);
""")

print("Sales table created successfully.")

#Populate Table
cursor.execute("""
INSERT INTO sales (sale_id, customer_name, amount, sale_date)
VALUES
(1, 'Aditi', 1500, '2024-08-01'),
(2, 'Rohan', 2200, '2024-08-03'),
(3, 'Aditi', 3500, '2024-09-05'),
(4, 'Meena', 2700, '2024-09-15'),
(5, 'Rohan', 4500, '2024-09-25');
""")

conn.commit()

print("Sales data inserted successfully.")

#Verifying Data
cursor.execute("SELECT * FROM sales;")
rows = cursor.fetchall()

for row in rows:
    print(row)

Sales table created successfully.
Sales data inserted successfully.
(1, 'Aditi', 1500, '2024-08-01')
(2, 'Rohan', 2200, '2024-08-03')
(3, 'Aditi', 3500, '2024-09-05')
(4, 'Meena', 2700, '2024-09-15')
(5, 'Rohan', 4500, '2024-09-25')

In [5]:
#Q7. Display All Sales Records Sorted by Amount (Highest → Lowest) .
#Hint: UseORDER BY amount DESC.
#->
cursor.execute("""
SELECT *
FROM sales
ORDER BY amount DESC;
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

(5, 'Rohan', 4500, '2024-09-25')
(3, 'Aditi', 3500, '2024-09-05')
(4, 'Meena', 2700, '2024-09-15')
(2, 'Rohan', 2200, '2024-08-03')
(1, 'Aditi', 1500, '2024-08-01')

In [6]:
#Q8. Show All Sales Made by Customer “Aditi”.
#Hint: Use WHERE customer_name = 'Aditi'.
#->
cursor.execute("""
SELECT *
FROM sales
WHERE customer_name = 'Aditi';
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Aditi', 1500, '2024-08-01')
(3, 'Aditi', 3500, '2024-09-05')

Q9. What is the Difference Between a Primary Key and a Foreign Key?
-> Primary Key-
1.A primary key uniquely identifies each record in a table.
2.It does not allow duplicate or NULL values.
3.Each table can have only one primary key.
4.It ensures entity integrity.
5.Example: employee_id in employees table.

Foreign Key-
1.A foreign key is used to link one table with another table.
2.It can have duplicate values and may allow NULL values.
3.A table can have multiple foreign keys.
4.It ensures referential integrity.
5.Example: employee_id in another table referencing employees

Q10. What Are Constraints in SQL and Why Are They Used?
-> -Constraints in SQL are rules applied to table columns to control the
type of data that can be stored in them.
-They ensure that the data in a database is accurate, valid, and consistent.
-Constraints are used to:
     Prevent invalid data from being entered.
     Maintain data integrity.
     Avoid duplicate or incorrect values.
     Ensure proper relationships between tables.

| Constraint  | Purpose                                    |
| ----------  | ------------------------------------------ |
| PRIMARY KEY | Uniquely identifies each record in a table |
| FOREIGN KEY | Links one table to another                 |
| NOT NULL    | Ensures a column cannot be empty           |
| UNIQUE      | Prevents duplicate values                  |
| CHECK       | Validates a condition                      |
| DEFAULT     | Sets a default value                       |